perf_output/before/memcached-1.6.9/32/memcached-1.6.9_workloadb_32_load.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:memcached-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /proj/proxyweb-PG0/adona/YCSB/memcached/conf:/proj/proxyweb-PG0/adona/YCSB/memcached/target/memcached-binding-0.18.0-SNAPSHOT.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/log4j/log4j/1.2.17/log4j-1.2.17.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.13/jackson-mapper-asl-1.9.13.jar:/root/.m2/repository/net/spy/spymemcached/2.11.4/spymemcached-2.11.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/proj/proxyweb-PG0/adona/YCSB/core/target/core-0.18.0-SNAPSHOT.jar site.ycsb.Client -db site.ycsb.db.MemcachedClient -threads 32 -s -P workloads/workloadb -p memcached.hosts=localhost:11211 -load
Command line: -db site.ycsb.db.MemcachedClient -threads 32 -s -P workloads/workloadb -p memcached.hosts=localhost:11211 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2021-08-11 17:50:32:672 0 sec: 0 operations; est completion in 0 second 
2021-08-11 17:50:32.814 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.815 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.814 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.814 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.815 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.818 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.818 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.819 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-08-11 17:50:32.819 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.820 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.821 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.822 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.823 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.823 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.824 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.824 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.825 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.825 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.826 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.826 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.826 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.827 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.827 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.828 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.829 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.830 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.832 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.832 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.833 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.833 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.834 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:50:32.834 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
[...]
2021-08-11 17:50:33.013 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.013 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.013 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.014 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.013 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.016 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.017 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.018 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.019 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.020 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.021 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.021 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.022 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.022 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.023 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.023 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.024 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.024 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.024 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.025 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.026 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.026 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.026 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
[...]
2021-08-11 17:50:33.027 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.027 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.027 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.028 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.028 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.029 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.030 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33.030 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:50:33:020 0 sec: 0 operations; est completion in 106751991167300 days 15 hours [CLEANUP: Count=32, Max=11343, Min=7348, Avg=9298.38, 90=11079, 99=11343, 99.9=11343, 99.99=11343] [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT-FAILED: Count=32, Max=163071, Min=128704, Avg=157153, 90=162815, 99=163071, 99.9=163071, 99.99=163071] 
[OVERALL], RunTime(ms), 347
[OVERALL], Throughput(ops/sec), 0.0
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 12
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 3.45821325648415
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 3.45821325648415
[CLEANUP], Operations, 32
[CLEANUP], AverageLatency(us), 9298.375
[CLEANUP], MinLatency(us), 7348
[CLEANUP], MaxLatency(us), 11343
[CLEANUP], 95thPercentileLatency(us), 11119
[CLEANUP], 99thPercentileLatency(us), 11343
[INSERT], Operations, 0
[INSERT], AverageLatency(us), NaN
[INSERT], MinLatency(us), 9223372036854775807
[INSERT], MaxLatency(us), 0
[INSERT], 95thPercentileLatency(us), 0
[INSERT], 99thPercentileLatency(us), 0
[INSERT], Return=ERROR, 32
[INSERT-FAILED], Operations, 32
[INSERT-FAILED], AverageLatency(us), 157153.0
[INSERT-FAILED], MinLatency(us), 128704
[INSERT-FAILED], MaxLatency(us), 163071
[INSERT-FAILED], 95thPercentileLatency(us), 162943
[INSERT-FAILED], 99thPercentileLatency(us), 163071

 Performance counter stats for 'system wide':

      102122438174      cycles                                                        (66.68%)
       20328017458      branches                                                      (66.68%)
         766559971      branch-misses             #    3.77% of all branches          (66.68%)
       20304462313      branch-loads                                                  (66.68%)
         762255966      branch-load-misses                                            (66.65%)
         709849707      L1-icache-load-misses                                         (66.66%)

      12.607320943 seconds time elapsed